Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [7]:
s1=pd.Series([4,8,15,16,23,42])
s1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [9]:
list=[1,2,3,4,5,6,7,8,9,5]
s2=pd.Series(list)
s2

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
9    5
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.
Name
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female

In [10]:
d1={"name":["Alice","Bob","Clire"],"Age":[25,30,27],"Gender":["Female","Male","Female"]}

In [12]:
data=pd.DataFrame(d1)
data

    name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male
2  Clire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In pandas, a DataFrame is a two-dimensional, tabular data structure that is used for data manipulation and analysis. A DataFrame consists of rows and columns, where each column can have a different data type (e.g., integers, strings, floats) and each row represents a record or observation

On the other hand, a pandas.Series is a one-dimensional labeled array. It can be thought of as a single column from a DataFrame. Each element in a Series is indexed, which means you can access the data using labels or integer-based indexing.

In [2]:
import pandas as pd

# Creating a DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35]}
df = pd.DataFrame(data)

# df is a DataFrame with two columns (Name and Age)
print("DataFrame")
print(df)
# Creating a Series
ages = pd.Series([25, 30, 35])

# ages is a Series with one column of data
print("Series")
print(ages)

DataFrame
      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
Series
0    25
1    30
2    35
dtype: int64

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Filtering Data:

Use df[df['column_name'] > value] to filter rows based on a condition. For instance, filtering employees with salaries above a certain threshold.
Selecting Columns:

Use df['column_name'] to select a single column. For example, extracting a specific feature or attribute.
Sorting Data:

Use df.sort_values(by='column_name') to sort the DataFrame. Useful when arranging data in ascending or descending order.
Grouping and Aggregating Data:

Use df.groupby('column_name').agg({'other_column': 'function'}) to group and perform aggregate calculations, like finding the mean salary for each department.
Adding and Removing Columns:

Use df['new_column'] = values to add a new column or df.drop('column_name', axis=1) to remove a column. This can help in feature engineering or data cleanup.
Handling Missing Data:

Use df.dropna() to remove rows with missing values or df.fillna(value) to fill missing values. Useful for data preprocessing and cleaning.
Merging and Joining Data:

Use pd.concat([df1, df2]) to concatenate DataFrames vertically or pd.merge(df1, df2, on='key') to merge DataFrames based on a common key. This is handy for combining related datasets.
These functions are essential for data manipulation and analysis in Pandas DataFrames and can be applied in various data analysis and data preprocessing tasks.

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In pandas, the Series and DataFrame are mutable, while the Panel is not.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [7]:
import pandas as pd

s1=pd.Series([1,2,3,4,5])
s2=pd.Series([43,65,46,32,99])

df=pd.DataFrame({'Column1':s1,'Column':s2})
df

   Column1  Column
0        1      43
1        2      65
2        3      46
3        4      32
4        5      99